In [3]:
import numpy as np
import pandas as pd

In [4]:
salary=pd.read_csv("basic_salary2.csv")

In [13]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 7 columns):
First_Name    41 non-null object
Last_Name     41 non-null object
Grade         40 non-null object
Location      38 non-null object
Function      39 non-null object
ba            39 non-null float64
ms            37 non-null float64
dtypes: float64(2), object(5)
memory usage: 2.3+ KB

In [14]:
#Same as summary() in R
salary.describe(include='all')

,First_Name,Last_Name,Grade,Location,Function,ba,ms
count,41,41,40,38,39,39.000000,37.000000
unique,37,38,2,2,3,NaN,NaN
top,Kavita,Singh,GR1,MUMBAI,SALES,NaN,NaN
freq,2,2,23,21,15,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,17209.743590,11939.054054
std,NaN,NaN,NaN,NaN,NaN,4159.515241,3223.018305
min,NaN,NaN,NaN,NaN,NaN,10940.000000,2700.000000
25%,NaN,NaN,NaN,NaN,NaN,13785.000000,10450.000000
50%,NaN,NaN,NaN,NaN,NaN,16230.000000,12420.000000
75%,NaN,NaN,NaN,NaN,NaN,19305.000000,14200.000000
max,NaN,NaN,NaN,NaN,NaN,29080.000000,16970.000000

In [15]:
salary.head(1)

  First_Name Last_Name Grade Location Function       ba       ms
0     Mahesh     Joshi   GR1    DELHI    SALES  17990.0  16070.0

In [5]:
#Dimension of the data
salary.shape

(41, 7)

In [17]:
salary[['Last_Name', 'First_Name']].head(1)

  Last_Name First_Name
0     Joshi     Mahesh

In [21]:
#subsetting using a criteria; like subset() in R
salary3=salary[(salary.Location == 'DELHI') & (salary.ba >20000)]

In [23]:
#To check the nan in the data
pd.isnull(salary).head(1)

   First_Name  Last_Name  Grade  Location  Function     ba     ms
0       False      False  False     False     False  False  False

In [33]:
#Show row which have nan. any() returns whether any element is True over requested axis. Its's format is pandas.dataframe.any
salary[pd.isnull(salary).any(axis=1)].head(6)

   First_Name Last_Name Grade Location Function       ba       ms
8       Nishi  Kulkarni   GR1      NaN    SALES  22620.0  16150.0
12     Anjali     Sonar   GR1   MUMBAI      NaN  14410.0  10450.0
14      Rahul    Potdar   GR1   MUMBAI    SALES  15125.0      NaN
15     Ganesh      Sane   NaN   MUMBAI    SALES      NaN  12120.0
17      Anand     Soman   GR1      NaN  FINANCE  16540.0  12780.0
23     Kavita        NS   GR1   MUMBAI      NaN  17520.0      NaN

In [34]:
salary6=salary[(salary.Grade!="GR!") & (salary.Location!='MUMBAI')]

In [53]:
#Sorting of data frame using pandas
#salary.sort_values(by='ba', ascending=False).head(2)
#sorting by multiple columns
salary.sort_values(by=['Grade','ba']).head(2)

   First_Name Last_Name Grade Location Function       ba       ms
12     Anjali     Sonar   GR1   MUMBAI      NaN  14410.0  10450.0
14      Rahul    Potdar   GR1   MUMBAI    SALES  15125.0      NaN

In [ ]:
#To delete a variable
%reset_selective sorted_salary9

In [66]:
#Different ways of joining two or more dataframes.

#Concatenation
join=pd.concat([salary, salary3], ignore_index=True)
#like rbind() in R
join3=pd.concat([salary, salary3], axis=1)

#Append
join1=salary.append(salary3, ignore_index=True)

#Merge
sal_data=pd.read_csv("sal_data.csv")
bonus_data=pd.read_csv("bonus_data.csv")
join2=pd.merge(sal_data, bonus_data,how='outer',on='Employee_ID')

In [72]:
#Aggregate 
A=salary.groupby('Location').agg({'ba':'mean'})

In [79]:
#To rename the column
salary.rename(columns={'ba':'Basic Allowance'}, inplace=True)

#The following command can be used to rename all or some of the columns.
salary.columns=[''] #not complete, when index is not mention, it can be used to rename all the columns
salary.columns[3]=[''] #not complete, it will rename column 4

'First_Name'

In [80]:
#Adding new column
salary['Bonus']=salary['Basic Allowance']*0.05

In [94]:
#Like the ifelse() in R, to change value stored in the column
salary['Location']=np.where(salary['Location']=='MUMBAI',1,2)

#np.where for multiple conditions
salary['Category']=np.where(salary['Basic Allowance']<14000,"Low",(np.where(salary['Basic Allowance']<19000,"Medium","High")))

#cut function like the function in R.
pd.cut(salary['Basic Allowance'], [0,14000,19000, np.inf], labels=['Low','Medium','High']).head(6)

In [104]:
#To remove first 5 rows
salary.drop(salary.index[0:5],inplace=True) 

#to remove columns
salary.drop(['Category'], axis=1)

In [113]:
#Frequency Table
pd.crosstab(index=salary.Grade,columns=salary.Function)

#Three-way Frequency Table
pd.crosstab(index=[salary.Grade, salary.Location],columns=salary.Function)

#Proportion table
pd.crosstab(index=salary.Grade, columns=salary.Function, normalize='index')

In [ ]:
#Converting variables to the date format

#in both the cases variable is stored as object type

#if the date is in some other format:
final['trending_date']=pd.to_datetime(final['trending_date'],format='%y.%d.%m')

#if variable is in proper format but stored as object:
final['publish_time']=pd.to_datetime(final['publish_time'])

In [ ]:
#to extract only date
final['publish_time'].dt.date

#to extract only time
final['publish_time'].dt.time